# ОБРАЗЕЦ
# вычислите сумму чисел 258 и 356 и выведите на экран
print('example: 258 + 356 =', 258 + 356)

# 1 вычислите разность чисел 12567 и 3521 и выведите на экран

# 2 вычислите произведение чисел 568 и 24 и выведите на экран

# 3 вычислите частное чисел 568 и 24 и выведите на экран

# 4 вычислите сумму чисел 0.2 и 0.1 и выведите на экран

# 5 вычислите куб 155 и выведите на экран

# 5 вычислите квадратный корень из 256 и выведите на экран

# 6 вычислите квадратный корень из -1 и выведите на экран

# 7 вычислите половину суммы 456 и 564 и выведите на экран

# 8 вычислите частное квадрата 564 и разности 45 и 13 и выведите на экран

# 9 выведите на экран результат целочисленного деления 453 на 12

# 10 выведите на экран остаток от деления 453 на 12