# ОБРАЗЕЦ
# поместите в переменную целое число и выведите его на экран
variable = 256
print('ОБРАЗЕЦ:', variable)

# 1 поместите в переменную дробное число и выведите его на экран

# 2 поместите в переменную отрицательное число и выведите его на экран

# 3 поместите в переменную сумму чисел 45632 и 86542 и выведите его на экран

# 4 поместите в две переменные разные числа и выведите на экран их произведение

# 5 поместите это призведение в третью переменную

# 6 поместите в переменную index целое число и выведите его на экран

# 7 увеличьте значение, хранящееся в переменной index на 10 и выведите его на экран