# Строковый тип данных
# first_string = 'hello, world!'
# print('first string:', first_string)
# other_string = "hello, world!"
# print('other string:', other_string)

# Вывод нескольких строк
# long_string = """First line.
# Second line.
# Third line """ 
# print(long_string)
# print()

# long_string_other_way = "First line.\nSecond line.\nThird line"
# print(long_string_other_way)

# Экранирование и сырые строки
# screen = "Вот так - '\\n' - выглядит спецсимвол конца строки\nследующий текст написан с новой строки, потому что спецсимвол перед низ не экранирован"
# print(screen)
# print()

# raw_string = r'Сырая строка: все спецсимволы отображаются: \n, \t'
# print(raw_string)

# f-строки
# name = 'Саша'
# common_part = f'Привет, {name}! Давай заниматься программированием!'
# print(common_part)
# name = 'Вася'
# common_part = f'Привет, {name}! Давай заниматься программированием!'
# print(common_part)
# print()

# number = 26
# cube_message = f'Куб числа {number} равен { number ** 3}'
# print(cube_message)

# Операции со строками
# конкатенация
# first_string = 'Hello,'
# second_string = 'World!'
# print(first_string + ' ' + second_string)
# print()

# Умножение
# rose = '@>->-- '
# bouquet = rose * 5
# print(bouquet)

# длина строки
# beatles_song = 'We all live in a Yellow Submarine'
# print('Длина строки: ',len(beatles_song))
# print()

# делаем все прописные
# upper_letters = beatles_song.upper()
# print(upper_letters)
# print()

# делаем все строчные
# lower_letters = beatles_song.lower()
# print(lower_letters)

# Задачи
# 1.	Создайте переменную и поместите в нее любой приветственный текст. 
# Выведите эту переменную на экран
# 2.	Сохраните первые 4 строки своей любимой песни в переменную, используя тройные 
# кавычки, и выведите текст на экран.
# 3.	Сохраните следующие 4 строки в переменную, используя одинарные кавычки 
# и символ переноса строки. Выведите текст на экран.
# 4.	Найдите в Интернете, какие в Python бывают спецсимволы 
# и выведите четыре из них на экран, используя для двух экранирование, а для двух – сырые строки.
# 5.	Создайте переменные для своих имени, фамилии и возраста. 
# Выведите на экран краткий рассказ о себе: как Вас зовут, сколько Вам лет 
# и чем любите заниматься в свободное время. Для вывода используйте f-строку, 
# созданные переменные передайте ей в качестве параметров.
# 6.	Создайте переменную и поместите в нее любое число. Используя f-строку 
# выведите на экран значение этой переменной, а рядом значение 
# математического выражения с ней. Выражение придумайте самостоятельно. 
# Опирайтесь на пример вывода куба числа в теории.
# 7.	Создайте несколько строковых переменных и выведите на экран их сумму.
# 8.	Создайте строковую переменную и умножьте ее на целое число. 
# Выведите результат на экран.
# 9.	Напишите цитату из Вашей любимой книги и сохраните ее в переменную. 
# Используя методы upper() и lower() измените регистр букв в строке.
